OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f1788.h
/*
 * This declarations of the PIC16F1788 MCU.
 *
 * This file is part of the GNU PIC library for SDCC, originally
 * created by Molnar Karoly <molnarkaroly@users.sf.net> 2016.
 *
 * This file is generated automatically by the cinc2h.pl, 2016-04-13 17:23:19 UTC.
 *
 * SDCC is licensed under the GNU Public license (GPL) v2. Note that
 * this license covers the code to the compiler and other executables,
 * but explicitly does not cover any code or objects generated by sdcc.
 *
 * For pic device libraries and header files which are derived from
 * Microchip header (.inc) and linker script (.lkr) files Microchip
 * requires that "The header files should state that they are only to be
 * used with authentic Microchip devices" which makes them incompatible
 * with the GPL. Pic device libraries and header files are located at
 * non-free/lib and non-free/include directories respectively.
 * Sdcc should be run with the --use-non-free command line option in
 * order to include non-free header files and libraries.
 *
 * See http://sdcc.sourceforge.net/ for the latest information on sdcc.
 */

#ifndef __PIC16F1788_H__
#define __PIC16F1788_H__

//==============================================================================
//
//	Register Addresses
//
//==============================================================================

#ifndef NO_ADDR_DEFINES

#define INDF0_ADDR              0x0000
#define INDF1_ADDR              0x0001
#define PCL_ADDR                0x0002
#define STATUS_ADDR             0x0003
#define FSR0_ADDR               0x0004
#define FSR0L_ADDR              0x0004
#define FSR0H_ADDR              0x0005
#define FSR1_ADDR               0x0006
#define FSR1L_ADDR              0x0006
#define FSR1H_ADDR              0x0007
#define BSR_ADDR                0x0008
#define WREG_ADDR               0x0009
#define PCLATH_ADDR             0x000A
#define INTCON_ADDR             0x000B
#define PORTA_ADDR              0x000C
#define PORTB_ADDR              0x000D
#define PORTC_ADDR              0x000E
#define PORTE_ADDR              0x0010
#define PIR1_ADDR               0x0011
#define PIR2_ADDR               0x0012
#define PIR3_ADDR               0x0013
#define PIR4_ADDR               0x0014
#define TMR0_ADDR               0x0015
#define TMR1_ADDR               0x0016
#define TMR1L_ADDR              0x0016
#define TMR1H_ADDR              0x0017
#define T1CON_ADDR              0x0018
#define T1GCON_ADDR             0x0019
#define TMR2_ADDR               0x001A
#define PR2_ADDR                0x001B
#define T2CON_ADDR              0x001C
#define TRISA_ADDR              0x008C
#define TRISB_ADDR              0x008D
#define TRISC_ADDR              0x008E
#define TRISE_ADDR              0x0090
#define PIE1_ADDR               0x0091
#define PIE2_ADDR               0x0092
#define PIE3_ADDR               0x0093
#define PIE4_ADDR               0x0094
#define OPTION_REG_ADDR         0x0095
#define PCON_ADDR               0x0096
#define WDTCON_ADDR             0x0097
#define OSCTUNE_ADDR            0x0098
#define OSCCON_ADDR             0x0099
#define OSCSTAT_ADDR            0x009A
#define ADRES_ADDR              0x009B
#define ADRESL_ADDR             0x009B
#define ADRESH_ADDR             0x009C
#define ADCON0_ADDR             0x009D
#define ADCON1_ADDR             0x009E
#define ADCON2_ADDR             0x009F
#define LATA_ADDR               0x010C
#define LATB_ADDR               0x010D
#define LATC_ADDR               0x010E
#define CM1CON0_ADDR            0x0111
#define CM1CON1_ADDR            0x0112
#define CM2CON0_ADDR            0x0113
#define CM2CON1_ADDR            0x0114
#define CMOUT_ADDR              0x0115
#define BORCON_ADDR             0x0116
#define FVRCON_ADDR             0x0117
#define DAC1CON0_ADDR           0x0118
#define DAC1CON1_ADDR           0x0119
#define CM4CON0_ADDR            0x011A
#define CM4CON1_ADDR            0x011B
#define APFCON2_ADDR            0x011C
#define APFCON_ADDR             0x011D
#define APFCON0_ADDR            0x011D
#define APFCON1_ADDR            0x011D
#define CM3CON0_ADDR            0x011E
#define CM3CON1_ADDR            0x011F
#define ANSELA_ADDR             0x018C
#define ANSELB_ADDR             0x018D
#define ANSELC_ADDR             0x018E
#define EEADR_ADDR              0x0191
#define EEADRL_ADDR             0x0191
#define EEADRH_ADDR             0x0192
#define EEDAT_ADDR              0x0193
#define EEDATL_ADDR             0x0193
#define EEDATH_ADDR             0x0194
#define EECON1_ADDR             0x0195
#define EECON2_ADDR             0x0196
#define VREGCON_ADDR            0x0197
#define RC1REG_ADDR             0x0199
#define RCREG_ADDR              0x0199
#define RCREG1_ADDR             0x0199
#define TX1REG_ADDR             0x019A
#define TXREG_ADDR              0x019A
#define TXREG1_ADDR             0x019A
#define SP1BRG_ADDR             0x019B
#define SP1BRGL_ADDR            0x019B
#define SPBRG_ADDR              0x019B
#define SPBRG1_ADDR             0x019B
#define SPBRGL_ADDR             0x019B
#define SP1BRGH_ADDR            0x019C
#define SPBRGH_ADDR             0x019C
#define SPBRGH1_ADDR            0x019C
#define RC1STA_ADDR             0x019D
#define RCSTA_ADDR              0x019D
#define RCSTA1_ADDR             0x019D
#define TX1STA_ADDR             0x019E
#define TXSTA_ADDR              0x019E
#define TXSTA1_ADDR             0x019E
#define BAUD1CON_ADDR           0x019F
#define BAUDCON_ADDR            0x019F
#define BAUDCON1_ADDR           0x019F
#define BAUDCTL_ADDR            0x019F
#define BAUDCTL1_ADDR           0x019F
#define WPUA_ADDR               0x020C
#define WPUB_ADDR               0x020D
#define WPUC_ADDR               0x020E
#define WPUE_ADDR               0x0210
#define SSP1BUF_ADDR            0x0211
#define SSPBUF_ADDR             0x0211
#define SSP1ADD_ADDR            0x0212
#define SSPADD_ADDR             0x0212
#define SSP1MSK_ADDR            0x0213
#define SSPMSK_ADDR             0x0213
#define SSP1STAT_ADDR           0x0214
#define SSPSTAT_ADDR            0x0214
#define SSP1CON_ADDR            0x0215
#define SSP1CON1_ADDR           0x0215
#define SSPCON_ADDR             0x0215
#define SSPCON1_ADDR            0x0215
#define SSP1CON2_ADDR           0x0216
#define SSPCON2_ADDR            0x0216
#define SSP1CON3_ADDR           0x0217
#define SSPCON3_ADDR            0x0217
#define ODCONA_ADDR             0x028C
#define ODCONB_ADDR             0x028D
#define ODCONC_ADDR             0x028E
#define CCPR1_ADDR              0x0291
#define CCPR1L_ADDR             0x0291
#define CCPR1H_ADDR             0x0292
#define CCP1CON_ADDR            0x0293
#define CCPR2_ADDR              0x0298
#define CCPR2L_ADDR             0x0298
#define CCPR2H_ADDR             0x0299
#define CCP2CON_ADDR            0x029A
#define SLRCONA_ADDR            0x030C
#define SLRCONB_ADDR            0x030D
#define SLRCONC_ADDR            0x030E
#define CCPR3_ADDR              0x0311
#define CCPR3L_ADDR             0x0311
#define CCPR3H_ADDR             0x0312
#define CCP3CON_ADDR            0x0313
#define INLVLA_ADDR             0x038C
#define INLVLB_ADDR             0x038D
#define INLVLC_ADDR             0x038E
#define INLVLE_ADDR             0x0390
#define IOCAP_ADDR              0x0391
#define IOCAN_ADDR              0x0392
#define IOCAF_ADDR              0x0393
#define IOCBP_ADDR              0x0394
#define IOCBN_ADDR              0x0395
#define IOCBF_ADDR              0x0396
#define IOCCP_ADDR              0x0397
#define IOCCN_ADDR              0x0398
#define IOCCF_ADDR              0x0399
#define IOCEP_ADDR              0x039D
#define IOCEN_ADDR              0x039E
#define IOCEF_ADDR              0x039F
#define OPA1CON_ADDR            0x0511
#define OPA2CON_ADDR            0x0513
#define CLKRCON_ADDR            0x051A
#define DAC2CON0_ADDR           0x0591
#define DAC2CON1_ADDR           0x0592
#define DAC2REF_ADDR            0x0592
#define DAC3CON0_ADDR           0x0593
#define DAC3CON1_ADDR           0x0594
#define DAC3REF_ADDR            0x0594
#define DAC4CON0_ADDR           0x0595
#define DAC4CON1_ADDR           0x0596
#define DAC4REF_ADDR            0x0596
#define PSMC1CON_ADDR           0x0E91
#define PSMC1MDL_ADDR           0x0E92
#define PSMC1SYNC_ADDR          0x0E93
#define PSMC1CLK_ADDR           0x0E94
#define PSMC1OEN_ADDR           0x0E95
#define PSMC1POL_ADDR           0x0E96
#define PSMC1BLNK_ADDR          0x0E97
#define PSMC1REBS_ADDR          0x0E98
#define PSMC1FEBS_ADDR          0x0E99
#define PSMC1PHS_ADDR           0x0E9A
#define PSMC1DCS_ADDR           0x0E9B
#define PSMC1PRS_ADDR           0x0E9C
#define PSMC1ASDC_ADDR          0x0E9D
#define PSMC1ASDL_ADDR          0x0E9E
#define PSMC1ASDS_ADDR          0x0E9F
#define PSMC1INT_ADDR           0x0EA0
#define PSMC1PH_ADDR            0x0EA1
#define PSMC1PHL_ADDR           0x0EA1
#define PSMC1PHH_ADDR           0x0EA2
#define PSMC1DC_ADDR            0x0EA3
#define PSMC1DCL_ADDR           0x0EA3
#define PSMC1DCH_ADDR           0x0EA4
#define PSMC1PR_ADDR            0x0EA5
#define PSMC1PRL_ADDR           0x0EA5
#define PSMC1PRH_ADDR           0x0EA6
#define PSMC1TMR_ADDR           0x0EA7
#define PSMC1TMRL_ADDR          0x0EA7
#define PSMC1TMRH_ADDR          0x0EA8
#define PSMC1DBR_ADDR           0x0EA9
#define PSMC1DBF_ADDR           0x0EAA
#define PSMC1BLKR_ADDR          0x0EAB
#define PSMC1BLKF_ADDR          0x0EAC
#define PSMC1FFA_ADDR           0x0EAD
#define PSMC1STR0_ADDR          0x0EAE
#define PSMC1STR1_ADDR          0x0EAF
#define PSMC2CON_ADDR           0x0EB1
#define PSMC2MDL_ADDR           0x0EB2
#define PSMC2SYNC_ADDR          0x0EB3
#define PSMC2CLK_ADDR           0x0EB4
#define PSMC2OEN_ADDR           0x0EB5
#define PSMC2POL_ADDR           0x0EB6
#define PSMC2BLNK_ADDR          0x0EB7
#define PSMC2REBS_ADDR          0x0EB8
#define PSMC2FEBS_ADDR          0x0EB9
#define PSMC2PHS_ADDR           0x0EBA
#define PSMC2DCS_ADDR           0x0EBB
#define PSMC2PRS_ADDR           0x0EBC
#define PSMC2ASDC_ADDR          0x0EBD
#define PSMC2ASDL_ADDR          0x0EBE
#define PSMC2ASDS_ADDR          0x0EBF
#define PSMC2INT_ADDR           0x0EC0
#define PSMC2PH_ADDR            0x0EC1
#define PSMC2PHL_ADDR           0x0EC1
#define PSMC2PHH_ADDR           0x0EC2
#define PSMC2DC_ADDR            0x0EC3
#define PSMC2DCL_ADDR           0x0EC3
#define PSMC2DCH_ADDR           0x0EC4
#define PSMC2PR_ADDR            0x0EC5
#define PSMC2PRL_ADDR           0x0EC5
#define PSMC2PRH_ADDR           0x0EC6
#define PSMC2TMR_ADDR           0x0EC7
#define PSMC2TMRL_ADDR          0x0EC7
#define PSMC2TMRH_ADDR          0x0EC8
#define PSMC2DBR_ADDR           0x0EC9
#define PSMC2DBF_ADDR           0x0ECA
#define PSMC2BLKR_ADDR          0x0ECB
#define PSMC2BLKF_ADDR          0x0ECC
#define PSMC2FFA_ADDR           0x0ECD
#define PSMC2STR0_ADDR          0x0ECE
#define PSMC2STR1_ADDR          0x0ECF
#define PSMC3CON_ADDR           0x0ED1
#define PSMC3MDL_ADDR           0x0ED2
#define PSMC3SYNC_ADDR          0x0ED3
#define PSMC3CLK_ADDR           0x0ED4
#define PSMC3OEN_ADDR           0x0ED5
#define PSMC3POL_ADDR           0x0ED6
#define PSMC3BLNK_ADDR          0x0ED7
#define PSMC3REBS_ADDR          0x0ED8
#define PSMC3FEBS_ADDR          0x0ED9
#define PSMC3PHS_ADDR           0x0EDA
#define PSMC3DCS_ADDR           0x0EDB
#define PSMC3PRS_ADDR           0x0EDC
#define PSMC3ASDC_ADDR          0x0EDD
#define PSMC3ASDL_ADDR          0x0EDE
#define PSMC3ASDS_ADDR          0x0EDF
#define PSMC3INT_ADDR           0x0EE0
#define PSMC3PH_ADDR            0x0EE1
#define PSMC3PHL_ADDR           0x0EE1
#define PSMC3PHH_ADDR           0x0EE2
#define PSMC3DC_ADDR            0x0EE3
#define PSMC3DCL_ADDR           0x0EE3
#define PSMC3DCH_ADDR           0x0EE4
#define PSMC3PR_ADDR            0x0EE5
#define PSMC3PRL_ADDR           0x0EE5
#define PSMC3PRH_ADDR           0x0EE6
#define PSMC3TMR_ADDR           0x0EE7
#define PSMC3TMRL_ADDR          0x0EE7
#define PSMC3TMRH_ADDR          0x0EE8
#define PSMC3DBR_ADDR           0x0EE9
#define PSMC3DBF_ADDR           0x0EEA
#define PSMC3BLKR_ADDR          0x0EEB
#define PSMC3BLKF_ADDR          0x0EEC
#define PSMC3FFA_ADDR           0x0EED
#define PSMC3STR0_ADDR          0x0EEE
#define PSMC3STR1_ADDR          0x0EEF
#define PSMC4CON_ADDR           0x0F11
#define PSMC4MDL_ADDR           0x0F12
#define PSMC4SYNC_ADDR          0x0F13
#define PSMC4CLK_ADDR           0x0F14
#define PSMC4OEN_ADDR           0x0F15
#define PSMC4POL_ADDR           0x0F16
#define PSMC4BLNK_ADDR          0x0F17
#define PSMC4REBS_ADDR          0x0F18
#define PSMC4FEBS_ADDR          0x0F19
#define PSMC4PHS_ADDR           0x0F1A
#define PSMC4DCS_ADDR           0x0F1B
#define PSMC4PRS_ADDR           0x0F1C
#define PSMC4ASDC_ADDR          0x0F1D
#define PSMC4ASDL_ADDR          0x0F1E
#define PSMC4ASDS_ADDR          0x0F1F
#define PSMC4INT_ADDR           0x0F20
#define PSMC4PH_ADDR            0x0F21
#define PSMC4PHL_ADDR           0x0F21
#define PSMC4PHH_ADDR           0x0F22
#define PSMC4DC_ADDR            0x0F23
#define PSMC4DCL_ADDR           0x0F23
#define PSMC4DCH_ADDR           0x0F24
#define PSMC4PR_ADDR            0x0F25
#define PSMC4PRL_ADDR           0x0F25
#define PSMC4PRH_ADDR           0x0F26
#define PSMC4TMR_ADDR           0x0F27
#define PSMC4TMRL_ADDR          0x0F27
#define PSMC4TMRH_ADDR          0x0F28
#define PSMC4DBR_ADDR           0x0F29
#define PSMC4DBF_ADDR           0x0F2A
#define PSMC4BLKR_ADDR          0x0F2B
#define PSMC4BLKF_ADDR          0x0F2C
#define PSMC4FFA_ADDR           0x0F2D
#define PSMC4STR0_ADDR          0x0F2E
#define PSMC4STR1_ADDR          0x0F2F
#define STATUS_SHAD_ADDR        0x0FE4
#define WREG_SHAD_ADDR          0x0FE5
#define BSR_SHAD_ADDR           0x0FE6
#define PCLATH_SHAD_ADDR        0x0FE7
#define FSR0L_SHAD_ADDR         0x0FE8
#define FSR0H_SHAD_ADDR         0x0FE9
#define FSR1L_SHAD_ADDR         0x0FEA
#define FSR1H_SHAD_ADDR         0x0FEB
#define STKPTR_ADDR             0x0FED
#define TOSL_ADDR               0x0FEE
#define TOSH_ADDR               0x0FEF

#endif // #ifndef NO_ADDR_DEFINES

//==============================================================================
//
//	Register Definitions
//
//==============================================================================

