OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f1788.h
extern __at(0x0EB1) __sfr PSMC2CON;

typedef union
  {
  struct
    {
    unsigned P2MODE0            : 1;
    unsigned P2MODE1            : 1;
    unsigned P2MODE2            : 1;
    unsigned P2MODE3            : 1;
    unsigned P2DBRE             : 1;
    unsigned P2DBFE             : 1;
    unsigned PSMC2LD            : 1;
    unsigned PSMC2EN            : 1;
    };

  struct
    {
    unsigned P2MODE             : 4;
    unsigned                    : 4;
    };
  } __PSMC2CONbits_t;

extern __at(0x0EB1) volatile __PSMC2CONbits_t PSMC2CONbits;

#define _P2MODE0                0x01
#define _P2MODE1                0x02
#define _P2MODE2                0x04
#define _P2MODE3                0x08
#define _P2DBRE                 0x10
#define _P2DBFE                 0x20
#define _PSMC2LD                0x40
#define _PSMC2EN                0x80

//==============================================================================


//==============================================================================
//        PSMC2MDL Bits

extern __at(0x0EB2) __sfr PSMC2MDL;

typedef union
  {
  struct
    {
    unsigned P2MSRC0            : 1;
    unsigned P2MSRC1            : 1;
    unsigned P2MSRC2            : 1;
    unsigned P2MSRC3            : 1;
    unsigned                    : 1;
    unsigned P2MDLBIT           : 1;
    unsigned P2MDLPOL           : 1;
    unsigned P2MDLEN            : 1;
    };

  struct
    {
    unsigned P2MSRC             : 4;
    unsigned                    : 4;
    };
  } __PSMC2MDLbits_t;

extern __at(0x0EB2) volatile __PSMC2MDLbits_t PSMC2MDLbits;

#define _P2MSRC0                0x01
#define _P2MSRC1                0x02
#define _P2MSRC2                0x04
#define _P2MSRC3                0x08
#define _P2MDLBIT               0x20
#define _P2MDLPOL               0x40
#define _P2MDLEN                0x80

//==============================================================================


//==============================================================================
//        PSMC2SYNC Bits

extern __at(0x0EB3) __sfr PSMC2SYNC;

typedef union
  {
  struct
    {
    unsigned P2SYNC0            : 1;
    unsigned P2SYNC1            : 1;
    unsigned P2SYNC2            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned P2DCPOL            : 1;
    unsigned P2PRPOL            : 1;
    unsigned P2POFST            : 1;
    };

  struct
    {
    unsigned P2SYNC             : 3;
    unsigned                    : 5;
    };
  } __PSMC2SYNCbits_t;

extern __at(0x0EB3) volatile __PSMC2SYNCbits_t PSMC2SYNCbits;

#define _P2SYNC0                0x01
#define _P2SYNC1                0x02
#define _P2SYNC2                0x04
#define _P2DCPOL                0x20
#define _P2PRPOL                0x40
#define _P2POFST                0x80

//==============================================================================


//==============================================================================
//        PSMC2CLK Bits

extern __at(0x0EB4) __sfr PSMC2CLK;

typedef union
  {
  struct
    {
    unsigned P2CSRC0            : 1;
    unsigned P2CSRC1            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned P2CPRE0            : 1;
    unsigned P2CPRE1            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned P2CSRC             : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned                    : 4;
    unsigned P2CPRE             : 2;
    unsigned                    : 2;
    };
  } __PSMC2CLKbits_t;

extern __at(0x0EB4) volatile __PSMC2CLKbits_t PSMC2CLKbits;

#define _P2CSRC0                0x01
#define _P2CSRC1                0x02
#define _P2CPRE0                0x10
#define _P2CPRE1                0x20

//==============================================================================


//==============================================================================
//        PSMC2OEN Bits

extern __at(0x0EB5) __sfr PSMC2OEN;

typedef struct
  {
  unsigned P2OEA                : 1;
  unsigned P2OEB                : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __PSMC2OENbits_t;

extern __at(0x0EB5) volatile __PSMC2OENbits_t PSMC2OENbits;

#define _P2OEA                  0x01
#define _P2OEB                  0x02

//==============================================================================


//==============================================================================
//        PSMC2POL Bits

extern __at(0x0EB6) __sfr PSMC2POL;

typedef struct
  {
  unsigned P2POLA               : 1;
  unsigned P2POLB               : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned P2INPOL              : 1;
  unsigned                      : 1;
  } __PSMC2POLbits_t;

extern __at(0x0EB6) volatile __PSMC2POLbits_t PSMC2POLbits;

#define _P2POLA                 0x01
#define _P2POLB                 0x02
#define _P2INPOL                0x40

//==============================================================================


//==============================================================================
//        PSMC2BLNK Bits

extern __at(0x0EB7) __sfr PSMC2BLNK;

typedef union
  {
  struct
    {
    unsigned P2REBM0            : 1;
    unsigned P2REBM1            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned P2FEBM0            : 1;
    unsigned P2FEBM1            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned P2REBM             : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned                    : 4;
    unsigned P2FEBM             : 2;
    unsigned                    : 2;
    };
  } __PSMC2BLNKbits_t;

extern __at(0x0EB7) volatile __PSMC2BLNKbits_t PSMC2BLNKbits;

#define _P2REBM0                0x01
#define _P2REBM1                0x02
#define _P2FEBM0                0x10
#define _P2FEBM1                0x20

//==============================================================================


//==============================================================================
//        PSMC2REBS Bits

extern __at(0x0EB8) __sfr PSMC2REBS;

typedef struct
  {
  unsigned                      : 1;
  unsigned P2REBSC1             : 1;
  unsigned P2REBSC2             : 1;
  unsigned P2REBSC3             : 1;
  unsigned P2REBSC4             : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned P2REBSIN             : 1;
  } __PSMC2REBSbits_t;

extern __at(0x0EB8) volatile __PSMC2REBSbits_t PSMC2REBSbits;

