OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f1788.h
extern __at(0x0EDB) __sfr PSMC3DCS;

typedef struct
  {
  unsigned P3DCST               : 1;
  unsigned P3DCSC1              : 1;
  unsigned P3DCSC2              : 1;
  unsigned P3DCSC3              : 1;
  unsigned P3DCSC4              : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned P3DCSIN              : 1;
  } __PSMC3DCSbits_t;

extern __at(0x0EDB) volatile __PSMC3DCSbits_t PSMC3DCSbits;

#define _P3DCST                 0x01
#define _P3DCSC1                0x02
#define _P3DCSC2                0x04
#define _P3DCSC3                0x08
#define _P3DCSC4                0x10
#define _P3DCSIN                0x80

//==============================================================================


//==============================================================================
//        PSMC3PRS Bits

extern __at(0x0EDC) __sfr PSMC3PRS;

typedef struct
  {
  unsigned P3PRST               : 1;
  unsigned P3PRSC1              : 1;
  unsigned P3PRSC2              : 1;
  unsigned P3PRSC3              : 1;
  unsigned P3PRSC4              : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned P3PRSIN              : 1;
  } __PSMC3PRSbits_t;

extern __at(0x0EDC) volatile __PSMC3PRSbits_t PSMC3PRSbits;

#define _P3PRST                 0x01
#define _P3PRSC1                0x02
#define _P3PRSC2                0x04
#define _P3PRSC3                0x08
#define _P3PRSC4                0x10
#define _P3PRSIN                0x80

//==============================================================================


//==============================================================================
//        PSMC3ASDC Bits

extern __at(0x0EDD) __sfr PSMC3ASDC;

typedef struct
  {
  unsigned P3ASDOV              : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned P3ARSEN              : 1;
  unsigned P3ASDEN              : 1;
  unsigned P3ASE                : 1;
  } __PSMC3ASDCbits_t;

extern __at(0x0EDD) volatile __PSMC3ASDCbits_t PSMC3ASDCbits;

#define _P3ASDOV                0x01
#define _P3ARSEN                0x20
#define _P3ASDEN                0x40
#define _P3ASE                  0x80

//==============================================================================


//==============================================================================
//        PSMC3ASDL Bits

extern __at(0x0EDE) __sfr PSMC3ASDL;

typedef struct
  {
  unsigned P3ASDLA              : 1;
  unsigned P3ASDLB              : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __PSMC3ASDLbits_t;

extern __at(0x0EDE) volatile __PSMC3ASDLbits_t PSMC3ASDLbits;

#define _P3ASDLA                0x01
#define _P3ASDLB                0x02

//==============================================================================


//==============================================================================
//        PSMC3ASDS Bits

extern __at(0x0EDF) __sfr PSMC3ASDS;

typedef struct
  {
  unsigned                      : 1;
  unsigned P3ASDSC1             : 1;
  unsigned P3ASDSC2             : 1;
  unsigned P3ASDSC3             : 1;
  unsigned P3ASDSC4             : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned P3ASDSIN             : 1;
  } __PSMC3ASDSbits_t;

extern __at(0x0EDF) volatile __PSMC3ASDSbits_t PSMC3ASDSbits;

#define _P3ASDSC1               0x02
#define _P3ASDSC2               0x04
#define _P3ASDSC3               0x08
#define _P3ASDSC4               0x10
#define _P3ASDSIN               0x80

//==============================================================================


//==============================================================================
//        PSMC3INT Bits

extern __at(0x0EE0) __sfr PSMC3INT;

typedef struct
  {
  unsigned P3TPRIF              : 1;
  unsigned P3TDCIF              : 1;
  unsigned P3TPHIF              : 1;
  unsigned P3TOVIF              : 1;
  unsigned P3TPRIE              : 1;
  unsigned P3TDCIE              : 1;
  unsigned P3TPHIE              : 1;
  unsigned P3TOVIE              : 1;
  } __PSMC3INTbits_t;

extern __at(0x0EE0) volatile __PSMC3INTbits_t PSMC3INTbits;

#define _P3TPRIF                0x01
#define _P3TDCIF                0x02
#define _P3TPHIF                0x04
#define _P3TOVIF                0x08
#define _P3TPRIE                0x10
#define _P3TDCIE                0x20
#define _P3TPHIE                0x40
#define _P3TOVIE                0x80

//==============================================================================

extern __at(0x0EE1) __sfr PSMC3PH;

//==============================================================================
//        PSMC3PHL Bits

extern __at(0x0EE1) __sfr PSMC3PHL;

typedef struct
  {
  unsigned PSMC3PH0             : 1;
  unsigned PSMC3PH1             : 1;
  unsigned PSMC3PH2             : 1;
  unsigned PSMC3PH3             : 1;
  unsigned PSMC3PH4             : 1;
  unsigned PSMC3PH5             : 1;
  unsigned PSMC3PH6             : 1;
  unsigned PSMC3PH7             : 1;
  } __PSMC3PHLbits_t;

extern __at(0x0EE1) volatile __PSMC3PHLbits_t PSMC3PHLbits;

#define _PSMC3PH0               0x01
#define _PSMC3PH1               0x02
#define _PSMC3PH2               0x04
#define _PSMC3PH3               0x08
#define _PSMC3PH4               0x10
#define _PSMC3PH5               0x20
#define _PSMC3PH6               0x40
#define _PSMC3PH7               0x80

//==============================================================================


//==============================================================================
//        PSMC3PHH Bits

extern __at(0x0EE2) __sfr PSMC3PHH;

typedef struct
  {
  unsigned PSMC3PH8             : 1;
  unsigned PSMC3PH9             : 1;
  unsigned PSMC3PH10            : 1;
  unsigned PSMC3PH11            : 1;
  unsigned PSMC3PH12            : 1;
  unsigned PSMC3PH13            : 1;
  unsigned PSMC3PH14            : 1;
  unsigned PSMC3PH15            : 1;
  } __PSMC3PHHbits_t;

extern __at(0x0EE2) volatile __PSMC3PHHbits_t PSMC3PHHbits;

#define _PSMC3PH8               0x01
#define _PSMC3PH9               0x02
#define _PSMC3PH10              0x04
#define _PSMC3PH11              0x08
#define _PSMC3PH12              0x10
#define _PSMC3PH13              0x20
#define _PSMC3PH14              0x40
#define _PSMC3PH15              0x80

//==============================================================================

