OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f1788.h
#define _P4SYNC0                0x01
#define _P4SYNC1                0x02
#define _P4SYNC2                0x04
#define _P4DCPOL                0x20
#define _P4PRPOL                0x40
#define _P4POFST                0x80

//==============================================================================


//==============================================================================
//        PSMC4CLK Bits

extern __at(0x0F14) __sfr PSMC4CLK;

typedef union
  {
  struct
    {
    unsigned P4CSRC0            : 1;
    unsigned P4CSRC1            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned P4CPRE0            : 1;
    unsigned P4CPRE1            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned P4CSRC             : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned                    : 4;
    unsigned P4CPRE             : 2;
    unsigned                    : 2;
    };
  } __PSMC4CLKbits_t;

extern __at(0x0F14) volatile __PSMC4CLKbits_t PSMC4CLKbits;

#define _P4CSRC0                0x01
#define _P4CSRC1                0x02
#define _P4CPRE0                0x10
#define _P4CPRE1                0x20

//==============================================================================


//==============================================================================
//        PSMC4OEN Bits

extern __at(0x0F15) __sfr PSMC4OEN;

typedef struct
  {
  unsigned P4OEA                : 1;
  unsigned P4OEB                : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __PSMC4OENbits_t;

extern __at(0x0F15) volatile __PSMC4OENbits_t PSMC4OENbits;

#define _P4OEA                  0x01
#define _P4OEB                  0x02

//==============================================================================


//==============================================================================
//        PSMC4POL Bits

extern __at(0x0F16) __sfr PSMC4POL;

typedef struct
  {
  unsigned P4POLA               : 1;
  unsigned P4POLB               : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned P4INPOL              : 1;
  unsigned                      : 1;
  } __PSMC4POLbits_t;

extern __at(0x0F16) volatile __PSMC4POLbits_t PSMC4POLbits;

#define _P4POLA                 0x01
#define _P4POLB                 0x02
#define _P4INPOL                0x40

//==============================================================================


//==============================================================================
//        PSMC4BLNK Bits

extern __at(0x0F17) __sfr PSMC4BLNK;

typedef union
  {
  struct
    {
    unsigned P4REBM0            : 1;
    unsigned P4REBM1            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned P4FEBM0            : 1;
    unsigned P4FEBM1            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned P4REBM             : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned                    : 4;
    unsigned P4FEBM             : 2;
    unsigned                    : 2;
    };
  } __PSMC4BLNKbits_t;

extern __at(0x0F17) volatile __PSMC4BLNKbits_t PSMC4BLNKbits;

#define _P4REBM0                0x01
#define _P4REBM1                0x02
#define _P4FEBM0                0x10
#define _P4FEBM1                0x20

//==============================================================================


//==============================================================================
//        PSMC4REBS Bits

extern __at(0x0F18) __sfr PSMC4REBS;

typedef struct
  {
  unsigned                      : 1;
  unsigned P4REBSC1             : 1;
  unsigned P4REBSC2             : 1;
  unsigned P4REBSC3             : 1;
  unsigned P4REBSC4             : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned P4REBSIN             : 1;
  } __PSMC4REBSbits_t;

extern __at(0x0F18) volatile __PSMC4REBSbits_t PSMC4REBSbits;

#define _P4REBSC1               0x02
#define _P4REBSC2               0x04
#define _P4REBSC3               0x08
#define _P4REBSC4               0x10
#define _P4REBSIN               0x80

//==============================================================================


//==============================================================================
//        PSMC4FEBS Bits

extern __at(0x0F19) __sfr PSMC4FEBS;

typedef struct
  {
  unsigned                      : 1;
  unsigned P4FEBSC1             : 1;
  unsigned P4FEBSC2             : 1;
  unsigned P4FEBSC3             : 1;
  unsigned P4FEBSC4             : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned P4FEBSIN             : 1;
  } __PSMC4FEBSbits_t;

extern __at(0x0F19) volatile __PSMC4FEBSbits_t PSMC4FEBSbits;

#define _P4FEBSC1               0x02
#define _P4FEBSC2               0x04
#define _P4FEBSC3               0x08
#define _P4FEBSC4               0x10
#define _P4FEBSIN               0x80

//==============================================================================


//==============================================================================
//        PSMC4PHS Bits

extern __at(0x0F1A) __sfr PSMC4PHS;

typedef struct
  {
  unsigned P4PHST               : 1;
  unsigned P4PHSC1              : 1;
  unsigned P4PHSC2              : 1;
  unsigned P4PHSC3              : 1;
  unsigned P4PHSC4              : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned P4PHSIN              : 1;
  } __PSMC4PHSbits_t;

extern __at(0x0F1A) volatile __PSMC4PHSbits_t PSMC4PHSbits;

#define _P4PHST                 0x01
#define _P4PHSC1                0x02
#define _P4PHSC2                0x04
#define _P4PHSC3                0x08
#define _P4PHSC4                0x10
#define _P4PHSIN                0x80

//==============================================================================


//==============================================================================
//        PSMC4DCS Bits

extern __at(0x0F1B) __sfr PSMC4DCS;

typedef struct
  {
  unsigned P4DCST               : 1;
  unsigned P4DCSC1              : 1;
  unsigned P4DCSC2              : 1;
  unsigned P4DCSC3              : 1;
  unsigned P4DCSC4              : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned P4DCSIN              : 1;
  } __PSMC4DCSbits_t;

extern __at(0x0F1B) volatile __PSMC4DCSbits_t PSMC4DCSbits;

#define _P4DCST                 0x01
#define _P4DCSC1                0x02
#define _P4DCSC2                0x04
#define _P4DCSC3                0x08
#define _P4DCSC4                0x10
#define _P4DCSIN                0x80

//==============================================================================


//==============================================================================
//        PSMC4PRS Bits

