OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f1788.h
extern __at(0x0F1C) __sfr PSMC4PRS;

typedef struct
  {
  unsigned P4PRST               : 1;
  unsigned P4PRSC1              : 1;
  unsigned P4PRSC2              : 1;
  unsigned P4PRSC3              : 1;
  unsigned P4PRSC4              : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned P4PRSIN              : 1;
  } __PSMC4PRSbits_t;

extern __at(0x0F1C) volatile __PSMC4PRSbits_t PSMC4PRSbits;

#define _P4PRST                 0x01
#define _P4PRSC1                0x02
#define _P4PRSC2                0x04
#define _P4PRSC3                0x08
#define _P4PRSC4                0x10
#define _P4PRSIN                0x80

//==============================================================================


//==============================================================================
//        PSMC4ASDC Bits

extern __at(0x0F1D) __sfr PSMC4ASDC;

typedef struct
  {
  unsigned P4ASDOV              : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned P4ARSEN              : 1;
  unsigned P4ASDEN              : 1;
  unsigned P4ASE                : 1;
  } __PSMC4ASDCbits_t;

extern __at(0x0F1D) volatile __PSMC4ASDCbits_t PSMC4ASDCbits;

#define _P4ASDOV                0x01
#define _P4ARSEN                0x20
#define _P4ASDEN                0x40
#define _P4ASE                  0x80

//==============================================================================


//==============================================================================
//        PSMC4ASDL Bits

extern __at(0x0F1E) __sfr PSMC4ASDL;

typedef struct
  {
  unsigned P4ASDLA              : 1;
  unsigned P4ASDLB              : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __PSMC4ASDLbits_t;

extern __at(0x0F1E) volatile __PSMC4ASDLbits_t PSMC4ASDLbits;

#define _P4ASDLA                0x01
#define _P4ASDLB                0x02

//==============================================================================


//==============================================================================
//        PSMC4ASDS Bits

extern __at(0x0F1F) __sfr PSMC4ASDS;

typedef struct
  {
  unsigned                      : 1;
  unsigned P4ASDSC1             : 1;
  unsigned P4ASDSC2             : 1;
  unsigned P4ASDSC3             : 1;
  unsigned P4ASDSC4             : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned P4ASDSIN             : 1;
  } __PSMC4ASDSbits_t;

extern __at(0x0F1F) volatile __PSMC4ASDSbits_t PSMC4ASDSbits;

#define _P4ASDSC1               0x02
#define _P4ASDSC2               0x04
#define _P4ASDSC3               0x08
#define _P4ASDSC4               0x10
#define _P4ASDSIN               0x80

//==============================================================================


//==============================================================================
//        PSMC4INT Bits

extern __at(0x0F20) __sfr PSMC4INT;

typedef struct
  {
  unsigned P4TPRIF              : 1;
  unsigned P4TDCIF              : 1;
  unsigned P4TPHIF              : 1;
  unsigned P4TOVIF              : 1;
  unsigned P4TPRIE              : 1;
  unsigned P4TDCIE              : 1;
  unsigned P4TPHIE              : 1;
  unsigned P4TOVIE              : 1;
  } __PSMC4INTbits_t;

extern __at(0x0F20) volatile __PSMC4INTbits_t PSMC4INTbits;

#define _P4TPRIF                0x01
#define _P4TDCIF                0x02
#define _P4TPHIF                0x04
#define _P4TOVIF                0x08
#define _P4TPRIE                0x10
#define _P4TDCIE                0x20
#define _P4TPHIE                0x40
#define _P4TOVIE                0x80

//==============================================================================

extern __at(0x0F21) __sfr PSMC4PH;

//==============================================================================
//        PSMC4PHL Bits

extern __at(0x0F21) __sfr PSMC4PHL;

typedef struct
  {
  unsigned PSMC4PH0             : 1;
  unsigned PSMC4PH1             : 1;
  unsigned PSMC4PH2             : 1;
  unsigned PSMC4PH3             : 1;
  unsigned PSMC4PH4             : 1;
  unsigned PSMC4PH5             : 1;
  unsigned PSMC4PH6             : 1;
  unsigned PSMC4PH7             : 1;
  } __PSMC4PHLbits_t;

extern __at(0x0F21) volatile __PSMC4PHLbits_t PSMC4PHLbits;

#define _PSMC4PH0               0x01
#define _PSMC4PH1               0x02
#define _PSMC4PH2               0x04
#define _PSMC4PH3               0x08
#define _PSMC4PH4               0x10
#define _PSMC4PH5               0x20
#define _PSMC4PH6               0x40
#define _PSMC4PH7               0x80

//==============================================================================


//==============================================================================
//        PSMC4PHH Bits

extern __at(0x0F22) __sfr PSMC4PHH;

typedef struct
  {
  unsigned PSMC4PH8             : 1;
  unsigned PSMC4PH9             : 1;
  unsigned PSMC4PH10            : 1;
  unsigned PSMC4PH11            : 1;
  unsigned PSMC4PH12            : 1;
  unsigned PSMC4PH13            : 1;
  unsigned PSMC4PH14            : 1;
  unsigned PSMC4PH15            : 1;
  } __PSMC4PHHbits_t;

extern __at(0x0F22) volatile __PSMC4PHHbits_t PSMC4PHHbits;

#define _PSMC4PH8               0x01
#define _PSMC4PH9               0x02
#define _PSMC4PH10              0x04
#define _PSMC4PH11              0x08
#define _PSMC4PH12              0x10
#define _PSMC4PH13              0x20
#define _PSMC4PH14              0x40
#define _PSMC4PH15              0x80

//==============================================================================

extern __at(0x0F23) __sfr PSMC4DC;

//==============================================================================
//        PSMC4DCL Bits

extern __at(0x0F23) __sfr PSMC4DCL;

typedef struct
  {
  unsigned PSMC4DC0             : 1;
  unsigned PSMC4DC1             : 1;
  unsigned PSMC4DC2             : 1;
  unsigned PSMC4DC3             : 1;
  unsigned PSMC4DC4             : 1;
  unsigned PSMC4DC5             : 1;
  unsigned PSMC4DC6             : 1;
  unsigned PSMC4DC7             : 1;
  } __PSMC4DCLbits_t;

extern __at(0x0F23) volatile __PSMC4DCLbits_t PSMC4DCLbits;

#define _PSMC4DC0               0x01
#define _PSMC4DC1               0x02
#define _PSMC4DC2               0x04
#define _PSMC4DC3               0x08
#define _PSMC4DC4               0x10
#define _PSMC4DC5               0x20
#define _PSMC4DC6               0x40
#define _PSMC4DC7               0x80

//==============================================================================


//==============================================================================
//        PSMC4DCH Bits

