OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f1788.h
#define LATC0                   LATCbits.LATC0                  // bit 0
#define LATC1                   LATCbits.LATC1                  // bit 1
#define LATC2                   LATCbits.LATC2                  // bit 2
#define LATC3                   LATCbits.LATC3                  // bit 3
#define LATC4                   LATCbits.LATC4                  // bit 4
#define LATC5                   LATCbits.LATC5                  // bit 5
#define LATC6                   LATCbits.LATC6                  // bit 6
#define LATC7                   LATCbits.LATC7                  // bit 7

#define ODCONA0                 ODCONAbits.ODCONA0              // bit 0
#define ODCONA1                 ODCONAbits.ODCONA1              // bit 1
#define ODCONA2                 ODCONAbits.ODCONA2              // bit 2
#define ODCONA3                 ODCONAbits.ODCONA3              // bit 3
#define ODCONA4                 ODCONAbits.ODCONA4              // bit 4
#define ODCONA5                 ODCONAbits.ODCONA5              // bit 5
#define ODCONA6                 ODCONAbits.ODCONA6              // bit 6
#define ODCONA7                 ODCONAbits.ODCONA7              // bit 7

#define ODCONB0                 ODCONBbits.ODCONB0              // bit 0
#define ODCONB1                 ODCONBbits.ODCONB1              // bit 1
#define ODCONB2                 ODCONBbits.ODCONB2              // bit 2
#define ODCONB3                 ODCONBbits.ODCONB3              // bit 3
#define ODCONB4                 ODCONBbits.ODCONB4              // bit 4
#define ODCONB5                 ODCONBbits.ODCONB5              // bit 5
#define ODCONB6                 ODCONBbits.ODCONB6              // bit 6
#define ODCONB7                 ODCONBbits.ODCONB7              // bit 7

#define ODCONC0                 ODCONCbits.ODCONC0              // bit 0
#define ODCONC1                 ODCONCbits.ODCONC1              // bit 1
#define ODCONC2                 ODCONCbits.ODCONC2              // bit 2
#define ODCONC3                 ODCONCbits.ODCONC3              // bit 3
#define ODCONC4                 ODCONCbits.ODCONC4              // bit 4
#define ODCONC5                 ODCONCbits.ODCONC5              // bit 5
#define ODCONC6                 ODCONCbits.ODCONC6              // bit 6
#define ODCONC7                 ODCONCbits.ODCONC7              // bit 7

#define OPA1PCH0                OPA1CONbits.OPA1PCH0            // bit 0, shadows bit in OPA1CONbits
#define PCH0                    OPA1CONbits.PCH0                // bit 0, shadows bit in OPA1CONbits
#define OPA1PCH1                OPA1CONbits.OPA1PCH1            // bit 1, shadows bit in OPA1CONbits
#define PCH1                    OPA1CONbits.PCH1                // bit 1, shadows bit in OPA1CONbits
#define OPA1PCH2                OPA1CONbits.OPA1PCH2            // bit 2, shadows bit in OPA1CONbits
#define PCH2                    OPA1CONbits.PCH2                // bit 2, shadows bit in OPA1CONbits
#define OPA1SP                  OPA1CONbits.OPA1SP              // bit 6, shadows bit in OPA1CONbits
#define SP                      OPA1CONbits.SP                  // bit 6, shadows bit in OPA1CONbits
#define OPA1EN                  OPA1CONbits.OPA1EN              // bit 7, shadows bit in OPA1CONbits
#define EN                      OPA1CONbits.EN                  // bit 7, shadows bit in OPA1CONbits

#define PS0                     OPTION_REGbits.PS0              // bit 0
#define PS1                     OPTION_REGbits.PS1              // bit 1
#define PS2                     OPTION_REGbits.PS2              // bit 2
#define PSA                     OPTION_REGbits.PSA              // bit 3
#define TMR0SE                  OPTION_REGbits.TMR0SE           // bit 4, shadows bit in OPTION_REGbits
#define T0SE                    OPTION_REGbits.T0SE             // bit 4, shadows bit in OPTION_REGbits
#define TMR0CS                  OPTION_REGbits.TMR0CS           // bit 5, shadows bit in OPTION_REGbits
#define T0CS                    OPTION_REGbits.T0CS             // bit 5, shadows bit in OPTION_REGbits
#define INTEDG                  OPTION_REGbits.INTEDG           // bit 6
#define NOT_WPUEN               OPTION_REGbits.NOT_WPUEN        // bit 7

#define SCS0                    OSCCONbits.SCS0                 // bit 0
#define SCS1                    OSCCONbits.SCS1                 // bit 1
#define IRCF0                   OSCCONbits.IRCF0                // bit 3
#define IRCF1                   OSCCONbits.IRCF1                // bit 4
#define IRCF2                   OSCCONbits.IRCF2                // bit 5
#define IRCF3                   OSCCONbits.IRCF3                // bit 6
#define SPLLEN                  OSCCONbits.SPLLEN               // bit 7

#define HFIOFS                  OSCSTATbits.HFIOFS              // bit 0
#define LFIOFR                  OSCSTATbits.LFIOFR              // bit 1
#define MFIOFR                  OSCSTATbits.MFIOFR              // bit 2
#define HFIOFL                  OSCSTATbits.HFIOFL              // bit 3
#define HFIOFR                  OSCSTATbits.HFIOFR              // bit 4
#define OSTS                    OSCSTATbits.OSTS                // bit 5
#define PLLR                    OSCSTATbits.PLLR                // bit 6
#define T1OSCR                  OSCSTATbits.T1OSCR              // bit 7

#define TUN0                    OSCTUNEbits.TUN0                // bit 0
#define TUN1                    OSCTUNEbits.TUN1                // bit 1
#define TUN2                    OSCTUNEbits.TUN2                // bit 2
#define TUN3                    OSCTUNEbits.TUN3                // bit 3
#define TUN4                    OSCTUNEbits.TUN4                // bit 4
#define TUN5                    OSCTUNEbits.TUN5                // bit 5

#define NOT_BOR                 PCONbits.NOT_BOR                // bit 0
#define NOT_POR                 PCONbits.NOT_POR                // bit 1
#define NOT_RI                  PCONbits.NOT_RI                 // bit 2
#define NOT_RMCLR               PCONbits.NOT_RMCLR              // bit 3
#define NOT_RWDT                PCONbits.NOT_RWDT               // bit 4
#define STKUNF                  PCONbits.STKUNF                 // bit 6
#define STKOVF                  PCONbits.STKOVF                 // bit 7

#define TMR1IE                  PIE1bits.TMR1IE                 // bit 0
#define TMR2IE                  PIE1bits.TMR2IE                 // bit 1
#define CCP1IE                  PIE1bits.CCP1IE                 // bit 2
#define SSP1IE                  PIE1bits.SSP1IE                 // bit 3
#define TXIE                    PIE1bits.TXIE                   // bit 4
#define RCIE                    PIE1bits.RCIE                   // bit 5
#define ADIE                    PIE1bits.ADIE                   // bit 6
#define TMR1GIE                 PIE1bits.TMR1GIE                // bit 7

#define CCP2IE                  PIE2bits.CCP2IE                 // bit 0
#define C3IE                    PIE2bits.C3IE                   // bit 1
#define C4IE                    PIE2bits.C4IE                   // bit 2
#define BCL1IE                  PIE2bits.BCL1IE                 // bit 3
#define EEIE                    PIE2bits.EEIE                   // bit 4
#define C1IE                    PIE2bits.C1IE                   // bit 5
#define C2IE                    PIE2bits.C2IE                   // bit 6
#define OSFIE                   PIE2bits.OSFIE                  // bit 7

#define CCP3IE                  PIE3bits.CCP3IE                 // bit 4

