OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f1788.h
#define PSMC1SIE                PIE4bits.PSMC1SIE               // bit 0
#define PSMC2SIE                PIE4bits.PSMC2SIE               // bit 1
#define PSMC3SIE                PIE4bits.PSMC3SIE               // bit 2
#define PSMC4SIE                PIE4bits.PSMC4SIE               // bit 3
#define PSMC1TIE                PIE4bits.PSMC1TIE               // bit 4
#define PSMC2TIE                PIE4bits.PSMC2TIE               // bit 5
#define PSMC3TIE                PIE4bits.PSMC3TIE               // bit 6, shadows bit in PIE4bits
#define PMSC3TIE                PIE4bits.PMSC3TIE               // bit 6, shadows bit in PIE4bits
#define PSMC4TIE                PIE4bits.PSMC4TIE               // bit 7

#define TMR1IF                  PIR1bits.TMR1IF                 // bit 0
#define TMR2IF                  PIR1bits.TMR2IF                 // bit 1
#define CCP1IF                  PIR1bits.CCP1IF                 // bit 2
#define SSP1IF                  PIR1bits.SSP1IF                 // bit 3
#define TXIF                    PIR1bits.TXIF                   // bit 4
#define RCIF                    PIR1bits.RCIF                   // bit 5
#define ADIF                    PIR1bits.ADIF                   // bit 6
#define TMR1GIF                 PIR1bits.TMR1GIF                // bit 7

#define CCP2IF                  PIR2bits.CCP2IF                 // bit 0
#define C3IF                    PIR2bits.C3IF                   // bit 1
#define C4IF                    PIR2bits.C4IF                   // bit 2
#define BCL1IF                  PIR2bits.BCL1IF                 // bit 3
#define EEIF                    PIR2bits.EEIF                   // bit 4
#define C1IF                    PIR2bits.C1IF                   // bit 5
#define C2IF                    PIR2bits.C2IF                   // bit 6
#define OSFIF                   PIR2bits.OSFIF                  // bit 7

#define CCP3IF                  PIR3bits.CCP3IF                 // bit 4

#define PSMC1SIF                PIR4bits.PSMC1SIF               // bit 0
#define PSMC2SIF                PIR4bits.PSMC2SIF               // bit 1
#define PSMC3SIF                PIR4bits.PSMC3SIF               // bit 2
#define PSMC4SIF                PIR4bits.PSMC4SIF               // bit 3
#define PSMC1TIF                PIR4bits.PSMC1TIF               // bit 4
#define PSMC2TIF                PIR4bits.PSMC2TIF               // bit 5
#define PSMC3TIF                PIR4bits.PSMC3TIF               // bit 6
#define PSMC4TIF                PIR4bits.PSMC4TIF               // bit 7

#define RA0                     PORTAbits.RA0                   // bit 0
#define RA1                     PORTAbits.RA1                   // bit 1
#define RA2                     PORTAbits.RA2                   // bit 2
#define RA3                     PORTAbits.RA3                   // bit 3
#define RA4                     PORTAbits.RA4                   // bit 4
#define RA5                     PORTAbits.RA5                   // bit 5
#define RA6                     PORTAbits.RA6                   // bit 6
#define RA7                     PORTAbits.RA7                   // bit 7

#define RB0                     PORTBbits.RB0                   // bit 0
#define RB1                     PORTBbits.RB1                   // bit 1
#define RB2                     PORTBbits.RB2                   // bit 2
#define RB3                     PORTBbits.RB3                   // bit 3
#define RB4                     PORTBbits.RB4                   // bit 4
#define RB5                     PORTBbits.RB5                   // bit 5
#define RB6                     PORTBbits.RB6                   // bit 6
#define RB7                     PORTBbits.RB7                   // bit 7

#define RC0                     PORTCbits.RC0                   // bit 0
#define RC1                     PORTCbits.RC1                   // bit 1
#define RC2                     PORTCbits.RC2                   // bit 2
#define RC3                     PORTCbits.RC3                   // bit 3
#define RC4                     PORTCbits.RC4                   // bit 4
#define RC5                     PORTCbits.RC5                   // bit 5
#define RC6                     PORTCbits.RC6                   // bit 6
#define RC7                     PORTCbits.RC7                   // bit 7

#define RE3                     PORTEbits.RE3                   // bit 3

#define P1ASDOV                 PSMC1ASDCbits.P1ASDOV           // bit 0
#define P1ARSEN                 PSMC1ASDCbits.P1ARSEN           // bit 5
#define P1ASDEN                 PSMC1ASDCbits.P1ASDEN           // bit 6
#define P1ASE                   PSMC1ASDCbits.P1ASE             // bit 7

#define P1ASDLA                 PSMC1ASDLbits.P1ASDLA           // bit 0
#define P1ASDLB                 PSMC1ASDLbits.P1ASDLB           // bit 1
#define P1ASDLC                 PSMC1ASDLbits.P1ASDLC           // bit 2
#define P1ASDLD                 PSMC1ASDLbits.P1ASDLD           // bit 3
#define P1ASDLE                 PSMC1ASDLbits.P1ASDLE           // bit 4
#define P1ASDLF                 PSMC1ASDLbits.P1ASDLF           // bit 5

#define P1ASDSC1                PSMC1ASDSbits.P1ASDSC1          // bit 1
#define P1ASDSC2                PSMC1ASDSbits.P1ASDSC2          // bit 2
#define P1ASDSC3                PSMC1ASDSbits.P1ASDSC3          // bit 3
#define P1ASDSC4                PSMC1ASDSbits.P1ASDSC4          // bit 4
#define P1ASDSIN                PSMC1ASDSbits.P1ASDSIN          // bit 7

#define PSMC1BLKF0              PSMC1BLKFbits.PSMC1BLKF0        // bit 0
#define PSMC1BLKF1              PSMC1BLKFbits.PSMC1BLKF1        // bit 1
#define PSMC1BLKF2              PSMC1BLKFbits.PSMC1BLKF2        // bit 2
#define PSMC1BLKF3              PSMC1BLKFbits.PSMC1BLKF3        // bit 3
#define PSMC1BLKF4              PSMC1BLKFbits.PSMC1BLKF4        // bit 4
#define PSMC1BLKF5              PSMC1BLKFbits.PSMC1BLKF5        // bit 5
#define PSMC1BLKF6              PSMC1BLKFbits.PSMC1BLKF6        // bit 6
#define PSMC1BLKF7              PSMC1BLKFbits.PSMC1BLKF7        // bit 7

#define PSMC1BLKR0              PSMC1BLKRbits.PSMC1BLKR0        // bit 0
#define PSMC1BLKR1              PSMC1BLKRbits.PSMC1BLKR1        // bit 1
#define PSMC1BLKR2              PSMC1BLKRbits.PSMC1BLKR2        // bit 2
#define PSMC1BLKR3              PSMC1BLKRbits.PSMC1BLKR3        // bit 3
#define PSMC1BLKR4              PSMC1BLKRbits.PSMC1BLKR4        // bit 4
#define PSMC1BLKR5              PSMC1BLKRbits.PSMC1BLKR5        // bit 5
#define PSMC1BLKR6              PSMC1BLKRbits.PSMC1BLKR6        // bit 6
#define PSMC1BLKR7              PSMC1BLKRbits.PSMC1BLKR7        // bit 7

