OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f1788.h
#define P4FEBSC1                PSMC4FEBSbits.P4FEBSC1          // bit 1
#define P4FEBSC2                PSMC4FEBSbits.P4FEBSC2          // bit 2
#define P4FEBSC3                PSMC4FEBSbits.P4FEBSC3          // bit 3
#define P4FEBSC4                PSMC4FEBSbits.P4FEBSC4          // bit 4
#define P4FEBSIN                PSMC4FEBSbits.P4FEBSIN          // bit 7

#define PSMC4FFA0               PSMC4FFAbits.PSMC4FFA0          // bit 0
#define PSMC4FFA1               PSMC4FFAbits.PSMC4FFA1          // bit 1
#define PSMC4FFA2               PSMC4FFAbits.PSMC4FFA2          // bit 2
#define PSMC4FFA3               PSMC4FFAbits.PSMC4FFA3          // bit 3

#define P4TPRIF                 PSMC4INTbits.P4TPRIF            // bit 0
#define P4TDCIF                 PSMC4INTbits.P4TDCIF            // bit 1
#define P4TPHIF                 PSMC4INTbits.P4TPHIF            // bit 2
#define P4TOVIF                 PSMC4INTbits.P4TOVIF            // bit 3
#define P4TPRIE                 PSMC4INTbits.P4TPRIE            // bit 4
#define P4TDCIE                 PSMC4INTbits.P4TDCIE            // bit 5
#define P4TPHIE                 PSMC4INTbits.P4TPHIE            // bit 6
#define P4TOVIE                 PSMC4INTbits.P4TOVIE            // bit 7

#define P4MSRC0                 PSMC4MDLbits.P4MSRC0            // bit 0
#define P4MSRC1                 PSMC4MDLbits.P4MSRC1            // bit 1
#define P4MSRC2                 PSMC4MDLbits.P4MSRC2            // bit 2
#define P4MSRC3                 PSMC4MDLbits.P4MSRC3            // bit 3
#define P4MDLBIT                PSMC4MDLbits.P4MDLBIT           // bit 5
#define P4MDLPOL                PSMC4MDLbits.P4MDLPOL           // bit 6
#define P4MDLEN                 PSMC4MDLbits.P4MDLEN            // bit 7

#define P4OEA                   PSMC4OENbits.P4OEA              // bit 0
#define P4OEB                   PSMC4OENbits.P4OEB              // bit 1

#define PSMC4PH8                PSMC4PHHbits.PSMC4PH8           // bit 0
#define PSMC4PH9                PSMC4PHHbits.PSMC4PH9           // bit 1
#define PSMC4PH10               PSMC4PHHbits.PSMC4PH10          // bit 2
#define PSMC4PH11               PSMC4PHHbits.PSMC4PH11          // bit 3
#define PSMC4PH12               PSMC4PHHbits.PSMC4PH12          // bit 4
#define PSMC4PH13               PSMC4PHHbits.PSMC4PH13          // bit 5
#define PSMC4PH14               PSMC4PHHbits.PSMC4PH14          // bit 6
#define PSMC4PH15               PSMC4PHHbits.PSMC4PH15          // bit 7

#define PSMC4PH0                PSMC4PHLbits.PSMC4PH0           // bit 0
#define PSMC4PH1                PSMC4PHLbits.PSMC4PH1           // bit 1
#define PSMC4PH2                PSMC4PHLbits.PSMC4PH2           // bit 2
#define PSMC4PH3                PSMC4PHLbits.PSMC4PH3           // bit 3
#define PSMC4PH4                PSMC4PHLbits.PSMC4PH4           // bit 4
#define PSMC4PH5                PSMC4PHLbits.PSMC4PH5           // bit 5
#define PSMC4PH6                PSMC4PHLbits.PSMC4PH6           // bit 6
#define PSMC4PH7                PSMC4PHLbits.PSMC4PH7           // bit 7

#define P4PHST                  PSMC4PHSbits.P4PHST             // bit 0
#define P4PHSC1                 PSMC4PHSbits.P4PHSC1            // bit 1
#define P4PHSC2                 PSMC4PHSbits.P4PHSC2            // bit 2
#define P4PHSC3                 PSMC4PHSbits.P4PHSC3            // bit 3
#define P4PHSC4                 PSMC4PHSbits.P4PHSC4            // bit 4
#define P4PHSIN                 PSMC4PHSbits.P4PHSIN            // bit 7

#define P4POLA                  PSMC4POLbits.P4POLA             // bit 0
#define P4POLB                  PSMC4POLbits.P4POLB             // bit 1
#define P4INPOL                 PSMC4POLbits.P4INPOL            // bit 6

#define PSMC4PR8                PSMC4PRHbits.PSMC4PR8           // bit 0
#define PSMC4PR9                PSMC4PRHbits.PSMC4PR9           // bit 1
#define PSMC4PR10               PSMC4PRHbits.PSMC4PR10          // bit 2
#define PSMC4PR11               PSMC4PRHbits.PSMC4PR11          // bit 3
#define PSMC4PR12               PSMC4PRHbits.PSMC4PR12          // bit 4
#define PSMC4PR13               PSMC4PRHbits.PSMC4PR13          // bit 5
#define PSMC4PR14               PSMC4PRHbits.PSMC4PR14          // bit 6
#define PSMC4PR15               PSMC4PRHbits.PSMC4PR15          // bit 7

#define PSMC4PR0                PSMC4PRLbits.PSMC4PR0           // bit 0
#define PSMC4PR1                PSMC4PRLbits.PSMC4PR1           // bit 1
#define PSMC4PR2                PSMC4PRLbits.PSMC4PR2           // bit 2
#define PSMC4PR3                PSMC4PRLbits.PSMC4PR3           // bit 3
#define PSMC4PR4                PSMC4PRLbits.PSMC4PR4           // bit 4
#define PSMC4PR5                PSMC4PRLbits.PSMC4PR5           // bit 5
#define PSMC4PR6                PSMC4PRLbits.PSMC4PR6           // bit 6
#define PSMC4PR7                PSMC4PRLbits.PSMC4PR7           // bit 7

#define P4PRST                  PSMC4PRSbits.P4PRST             // bit 0
#define P4PRSC1                 PSMC4PRSbits.P4PRSC1            // bit 1
#define P4PRSC2                 PSMC4PRSbits.P4PRSC2            // bit 2
#define P4PRSC3                 PSMC4PRSbits.P4PRSC3            // bit 3
#define P4PRSC4                 PSMC4PRSbits.P4PRSC4            // bit 4
#define P4PRSIN                 PSMC4PRSbits.P4PRSIN            // bit 7

#define P4REBSC1                PSMC4REBSbits.P4REBSC1          // bit 1
#define P4REBSC2                PSMC4REBSbits.P4REBSC2          // bit 2
#define P4REBSC3                PSMC4REBSbits.P4REBSC3          // bit 3
#define P4REBSC4                PSMC4REBSbits.P4REBSC4          // bit 4
#define P4REBSIN                PSMC4REBSbits.P4REBSIN          // bit 7

#define P4STRA                  PSMC4STR0bits.P4STRA            // bit 0
#define P4STRB                  PSMC4STR0bits.P4STRB            // bit 1

#define P4HSMEN                 PSMC4STR1bits.P4HSMEN           // bit 0
#define P4LSMEN                 PSMC4STR1bits.P4LSMEN           // bit 1
#define P4SSYNC                 PSMC4STR1bits.P4SSYNC           // bit 7

#define P4SYNC0                 PSMC4SYNCbits.P4SYNC0           // bit 0
#define P4SYNC1                 PSMC4SYNCbits.P4SYNC1           // bit 1
#define P4SYNC2                 PSMC4SYNCbits.P4SYNC2           // bit 2
#define P4DCPOL                 PSMC4SYNCbits.P4DCPOL           // bit 5
#define P4PRPOL                 PSMC4SYNCbits.P4PRPOL           // bit 6
#define P4POFST                 PSMC4SYNCbits.P4POFST           // bit 7

#define PSMC4TMR8               PSMC4TMRHbits.PSMC4TMR8         // bit 0
#define PSMC4TMR9               PSMC4TMRHbits.PSMC4TMR9         // bit 1
#define PSMC4TMR10              PSMC4TMRHbits.PSMC4TMR10        // bit 2
#define PSMC4TMR11              PSMC4TMRHbits.PSMC4TMR11        // bit 3
#define PSMC4TMR12              PSMC4TMRHbits.PSMC4TMR12        // bit 4
#define PSMC4TMR13              PSMC4TMRHbits.PSMC4TMR13        // bit 5
#define PSMC4TMR14              PSMC4TMRHbits.PSMC4TMR14        // bit 6
#define PSMC4TMR15              PSMC4TMRHbits.PSMC4TMR15        // bit 7

#define PSMC4TMR0               PSMC4TMRLbits.PSMC4TMR0         // bit 0
#define PSMC4TMR1               PSMC4TMRLbits.PSMC4TMR1         // bit 1
#define PSMC4TMR2               PSMC4TMRLbits.PSMC4TMR2         // bit 2
#define PSMC4TMR3               PSMC4TMRLbits.PSMC4TMR3         // bit 3
#define PSMC4TMR4               PSMC4TMRLbits.PSMC4TMR4         // bit 4
#define PSMC4TMR5               PSMC4TMRLbits.PSMC4TMR5         // bit 5
#define PSMC4TMR6               PSMC4TMRLbits.PSMC4TMR6         // bit 6
#define PSMC4TMR7               PSMC4TMRLbits.PSMC4TMR7         // bit 7

